<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"cc899cb7d3d3d312f2e2c7fcbe09d8a3b4fdb16ca91370174e0b73b835f7bca7","plan_job_ref":"Job Test plan target and replace #318 at https://github.com/dflook/terraform-github-actions/actions/runs/4079409934","plan_hash":"30a9c22102e8da1cdd3fd5847b4cd985dc3387783f680feaa412eaeafcc0a05f","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "H02mDUcLoq" -> (known after apply)
  ~ foreach = "E3ZFTTdJqK" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #318](https://github.com/dflook/terraform-github-actions/actions/runs/4079409934)